<template>
  <div>
    <div>
      <div
        class="
          card
          2xl:w-10/12
          xl:w-10/12
          lg:w-10/12
          md:w-8/12
          sm:w-8/12
          xs:w-4/12
          4xl:w-7/12
          5xl:w-7/12
          2xl:mr-36
          xl:mr-36
          4xl:mr-48
          5xl:mr-44
          lg:mr-20
          md:mr-56
          sm:mr-48
          xs:mr-80
          mt-5
          bg-base-100
          shadow-xl
        "
      >
        <div class="card-body">
          <div class="flex items-center justify-center">فروشگاه نرمش</div>
          <div>
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی
            در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
            می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
            الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این
            صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و
            شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای
            اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
            استفاده قرار گیرد.
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style>
</style>